       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADVENT-RUCKSACK.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       
       PROCEDURE DIVISION.

       END PROGRAM ADVENT-RUCKSACK.